settings-desctiption = ⚙️ НАСТРОЙКИ:

                       Время начала: { $start_time }:00
                       Время окончания: { $end_time }:00
                       Периодичность: каждый { $frequency } час
                       Язык: { $lang }

stat-description =  📊 ТВОЯ СТАТИСТИКА:

                    Всего ответов:  { $all }
                    Из них правильных: { $correct }
                    Процент правильных: { $correct_percent }%
                    Выучено слов: { $learned }
