start = Привет!
        Я бот, который поможет тебе учить литовские слова. Я буду присылать тебе новые слова, чтобы ты учил их. Начнем?

help =  Этот бот поможет тебе выучить литовские слова легко и интересно.


        Чтобы начать, просто нажми на кнопку "Поехали" или используй команду /start.
        Бот предложит тебе слово на литовском или русском языке с несколькими вариантами перевода.
        Твоя задача — выбрать правильный

        Если хочешь настроить расписание напоминаний, перейди в раздел "Настройки" или введи команду /settings.
        А статистику твоих успехов можно посмотреть с помощью команды /statistics.

no-answer = Я тебя не понял :(

change-start-time = 🕧 Выбери время начала напоминаний (час)

change-end-time = 🕝 Выбери время окончания напоминаний (час)

change-frequency = ⏳ Укажи, с какой периодичностью (в часах) будут приходить напоминания

change-language = 🌐 Выбери язык бота

saved-settings = ✔️ Ура! Настройки сохранены.
                 Давай начнем учиться прямо сейчас?

error-no-settings = ⚠️Упс... Настройки не найдены. Давай внесем новые?

error-no-stat = ⚠️ Похоже, ты еще не учил слова. Чтобы начать учиться прямо сейчас, просто нажми кнопку

cancel-settings = ✖️ Настройки оставлены без изменений

message-text-1 = переводится как:

message-text-2 = значит:

correct-answer = ✅ Молодец! Это верный ответ!

wrong-answer = ❌ Ошибка!

cancel-learning = 😎 Отлично поучились!

                  Если захочешь вернуться к словам, просто нажми кнопку 'Поехали!'

already-learned = 👌 Договорились! Больше не буду показывать тебе это слово

schedule-message = 😉 Привет! Время учить новые слова!

